# Shift

## Description
Shift returns TRUE if the Shift key was depressed during the last user event. This function operates with the MouseDown, KeyDown, AutoKey, GetPt, GetPtL, GetLine, and GetRect calls.

```pascal
FUNCTION Shift : BOOLEAN;
```

```python
def vs.Shift():
    return BOOLEAN
```

## Version
Availability: from All Versions

## Category
* User Interactive